tutorials/conceptLaserM2/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#includeEtc     "caseDicts/mesh/generation/snappyHexMeshDict.cfg"

castellatedMesh true;

snap            false;

addLayers       false;

geometry
{
    refinementBox
    {
        type            searchableBox;
        min             ( 0 -351e-6 -601e-6 );
        max             ( 0.005001 351e-6 0.00);
    }
}

castellatedMeshControls
{
    features        ( );
    refinementSurfaces
    {
    }
    refinementRegions
    {
        refinementBox
        {
            mode            inside;
            levels          ( ( 3 3 ) );
        }
    }
    nCellsBetweenLevels 3;
    locationInMesh  ( 0 0 0 );
}

snapControls
{
}

addLayersControls
{
    layers
    {
    }
    relativeSizes   true;
    expansionRatio  1.2;
    finalLayerThickness 0.5;
    minThickness    0.001;
}

mergeTolerance  1e-08;


// ************************************************************************* //

