tutorials/conceptLaserM2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1200;
        startFace       3462536;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          24816;
        startFace       3463736;
    }
    sides
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          3200;
        startFace       3488552;
    }
)

// ************************************************************************* //
