tutorials/conceptLaserM2/constant/heatSourceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          heatSourceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sources         ( beam );

beam
{
    pathName        scanPath;

    absorptionModel Kelly;
    KellyCoeffs
    {
        geometry        cylinder;
        eta0            0.36;
        etaMin          0.5;
    }

    heatSourceModel conceptLaserM2;
    conceptLaserM2Coeffs
    {
        dimensions      ( 62.5e-06 62.5e-06 3e-05 );
        nPoints         ( 3 3 5 );
        transient       true;
        isoValue        1709;
    }
}


// ************************************************************************* //
