tutorials/conceptLaserM2/constant/scanPath
Mode X Y Z Power Param
1 0.0 0.0 0.0 0.0 0.0
0 0.005 0.0 0.0 380.0 0.75
