tutorials/conceptLaserM2/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solid
{
    kappa   (9.738e+00   9.650e-03   0.0);
    Cp      (4.065e+02   1.992e-01   0.0);
}

liquid
{
    kappa   (2.405e+01   5.608e-03   0.0);
    Cp      (7.736e+02   2.123e-02   0.0);
}

powder
{
    kappa   (9.738e+00   9.650e-03   0.0);
    Cp      (4.065e+02   1.992e-01   0.0);
}

rho     [1 -3 0 0 0 0 0]    7010.01;
mu      [1 -1 -1  0 0 0 0]  0.002188;
beta    [0 0 0 -1 0 0 0]    3.101e-5;
DAS     [0 1 0 0 0 0 0]     10e-6;
Lf      [0  2 -2  0 0 0 0]  2.68e5;

// ************************************************************************* //
