tutorials/conceptLaserM2/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

surfaces
{
    type            surfaces;
    libs            ("libsampling.so");
    writeControl    writeTime;

    surfaceFormat   vtk;
    writeFormat     ascii;
    fields          (T);

    interpolationScheme cellPoint;

    surfaces
    (
        liquidus
        {
            type            isoSurface;
            isoField        T;
            isoValue        1709;
            interpolate     true;
        }
    );
}

// ************************************************************************* //

